In [1]:
import findspark
findspark.init()
from pyspark.sql import *
from pyspark import  SparkContext

sc = SparkContext( 'local', 'pyspark')
sql = SQLContext(sc)

In [2]:
df = sql.read.csv("train.csv", inferSchema = True, header = True)

In [3]:
df.first()

Row(PassengerId=1, Survived=0, Pclass=3, Name='Braund, Mr. Owen Harris', Sex='male', Age=22.0, SibSp=1, Parch=0, Ticket='A/5 21171', Fare=7.25, Cabin=None, Embarked='S')

In [4]:
df.take(2)

[Row(PassengerId=1, Survived=0, Pclass=3, Name='Braund, Mr. Owen Harris', Sex='male', Age=22.0, SibSp=1, Parch=0, Ticket='A/5 21171', Fare=7.25, Cabin=None, Embarked='S'),
 Row(PassengerId=2, Survived=1, Pclass=1, Name='Cumings, Mrs. John Bradley (Florence Briggs Thayer)', Sex='female', Age=38.0, SibSp=1, Parch=0, Ticket='PC 17599', Fare=71.2833, Cabin='C85', Embarked='C')]

In [5]:
df.printSchema()

root
 |-- PassengerId: integer (nullable = true)
 |-- Survived: integer (nullable = true)
 |-- Pclass: integer (nullable = true)
 |-- Name: string (nullable = true)
 |-- Sex: string (nullable = true)
 |-- Age: double (nullable = true)
 |-- SibSp: integer (nullable = true)
 |-- Parch: integer (nullable = true)
 |-- Ticket: string (nullable = true)
 |-- Fare: double (nullable = true)
 |-- Cabin: string (nullable = true)
 |-- Embarked: string (nullable = true)

In [6]:
df.describe('Age').show()

+-------+------------------+
|summary|               Age|
+-------+------------------+
|  count|               714|
|   mean| 29.69911764705882|
| stddev|14.526497332334035|
|    min|              0.42|
|    max|              80.0|
+-------+------------------+

In [7]:
df.filter(df['Age'] > 60).count()

22

In [8]:
df.groupby('Sex').count().show()

+------+-----+
|   Sex|count|
+------+-----+
|female|  314|
|  male|  577|
+------+-----+

In [9]:
from pyspark.sql.functions import desc
sortByFare = df.sort((desc('Fare'))).show()
sortByFare = df.sort(-df['Fare']).show() #see the use of - operator for desc

+-----------+--------+------+--------------------+------+----+-----+-----+--------+--------+---------------+--------+
|PassengerId|Survived|Pclass|                Name|   Sex| Age|SibSp|Parch|  Ticket|    Fare|          Cabin|Embarked|
+-----------+--------+------+--------------------+------+----+-----+-----+--------+--------+---------------+--------+
|        738|       1|     1|Lesurer, Mr. Gust...|  male|35.0|    0|    0|PC 17755|512.3292|           B101|       C|
|        680|       1|     1|Cardeza, Mr. Thom...|  male|36.0|    0|    1|PC 17755|512.3292|    B51 B53 B55|       C|
|        259|       1|     1|    Ward, Miss. Anna|female|35.0|    0|    0|PC 17755|512.3292|           null|       C|
|        342|       1|     1|Fortune, Miss. Al...|female|24.0|    3|    2|   19950|   263.0|    C23 C25 C27|       S|
|        439|       0|     1|   Fortune, Mr. Mark|  male|64.0|    1|    4|   19950|   263.0|    C23 C25 C27|       S|
|         28|       0|     1|Fortune, Mr. Char...|  male|19.0|    3|    2|   19950|   263.0|    C23 C25 C27|       S|
|         89|       1|     1|Fortune, Miss. Ma...|female|23.0|    3|    2|   19950|   263.0|    C23 C25 C27|       S|
|        743|       1|     1|"Ryerson, Miss. S...|female|21.0|    2|    2|PC 17608| 262.375|B57 B59 B63 B66|       C|
|        312|       1|     1|Ryerson, Miss. Em...|female|18.0|    2|    2|PC 17608| 262.375|B57 B59 B63 B66|       C|
|        119|       0|     1|Baxter, Mr. Quigg...|  male|24.0|    0|    1|PC 17558|247.5208|        B58 B60|       C|
|        300|       1|     1|Baxter, Mrs. Jame...|female|50.0|    0|    1|PC 17558|247.5208|        B58 B60|       C|
|        558|       0|     1| Robbins, Mr. Victor|  male|null|    0|    0|PC 17757| 227.525|           null|       C|
|        701|       1|     1|Astor, Mrs. John ...|female|18.0|    1|    0|PC 17757| 227.525|        C62 C64|       C|
|        717|       1|     1|Endres, Miss. Car...|female|38.0|    0|    0|PC 17757| 227.525|            C45|       C|
|        381|       1|     1|Bidois, Miss. Ros...|female|42.0|    0|    0|PC 17757| 227.525|           null|       C|
|        528|       0|     1|  Farthing, Mr. John|  male|null|    0|    0|PC 17483|221.7792|            C95|       S|
|        378|       0|     1|Widener, Mr. Harr...|  male|27.0|    0|    2|  113503|   211.5|            C82|       C|
|        690|       1|     1|Madill, Miss. Geo...|female|15.0|    0|    1|   24160|211.3375|             B5|       S|
|        731|       1|     1|Allen, Miss. Elis...|female|29.0|    0|    0|   24160|211.3375|             B5|       S|
|        780|       1|     1|Robert, Mrs. Edwa...|female|43.0|    0|    1|   24160|211.3375|             B3|       S|
+-----------+--------+------+--------------------+------+----+-----+-----+--------+--------+---------------+--------+
only showing top 20 rows

+-----------+--------+------+--------------------+------+----+-----+-----+--------+--------+---------------+--------+
|PassengerId|Survived|Pclass|                Name|   Sex| Age|SibSp|Parch|  Ticket|    Fare|          Cabin|Embarked|
+-----------+--------+------+--------------------+------+----+-----+-----+--------+--------+---------------+--------+
|        738|       1|     1|Lesurer, Mr. Gust...|  male|35.0|    0|    0|PC 17755|512.3292|           B101|       C|
|        680|       1|     1|Cardeza, Mr. Thom...|  male|36.0|    0|    1|PC 17755|512.3292|    B51 B53 B55|       C|
|        259|       1|     1|    Ward, Miss. Anna|female|35.0|    0|    0|PC 17755|512.3292|           null|       C|
|        342|       1|     1|Fortune, Miss. Al...|female|24.0|    3|    2|   19950|   263.0|    C23 C25 C27|       S|
|        439|       0|     1|   Fortune, Mr. Mark|  male|64.0|    1|    4|   19950|   263.0|    C23 C25 C27|       S|
|         28|       0|     1|Fortune, Mr. Char...|  male|19.0|    3|    2|   19950|   263.0|    C23 C25 C27|       S|
|         89|       1|     1|Fortune, Miss. Ma...|female|23.0|    3|    2|   19950|   263.0|    C23 C25 C27|       S|
|        743|       1|     1|"Ryerson, Miss. S...|female|21.0|    2|    2|PC 17608| 262.375|B57 B59 B63 B66|       C|
|        312|       1|     1|Ryerson, Miss. Em...|female|18.0|    2|    2|PC 17608| 262.375|B57 B59 B63 B66|       C|
|        119|       0|     1|Baxter, Mr. Quigg...|  male|24.0|    0|    1|PC 17558|247.5208|        B58 B60|       C|
|        300|       1|     1|Baxter, Mrs. Jame...|female|50.0|    0|    1|PC 17558|247.5208|        B58 B60|       C|
|        558|       0|     1| Robbins, Mr. Victor|  male|null|    0|    0|PC 17757| 227.525|           null|       C|
|        701|       1|     1|Astor, Mrs. John ...|female|18.0|    1|    0|PC 17757| 227.525|        C62 C64|       C|
|        717|       1|     1|Endres, Miss. Car...|female|38.0|    0|    0|PC 17757| 227.525|            C45|       C|
|        381|       1|     1|Bidois, Miss. Ros...|female|42.0|    0|    0|PC 17757| 227.525|           null|       C|
|        528|       0|     1|  Farthing, Mr. John|  male|null|    0|    0|PC 17483|221.7792|            C95|       S|
|        378|       0|     1|Widener, Mr. Harr...|  male|27.0|    0|    2|  113503|   211.5|            C82|       C|
|        690|       1|     1|Madill, Miss. Geo...|female|15.0|    0|    1|   24160|211.3375|             B5|       S|
|        731|       1|     1|Allen, Miss. Elis...|female|29.0|    0|    0|   24160|211.3375|             B5|       S|
|        780|       1|     1|Robert, Mrs. Edwa...|female|43.0|    0|    1|   24160|211.3375|             B3|       S|
+-----------+--------+------+--------------------+------+----+-----+-----+--------+--------+---------------+--------+
only showing top 20 rows

In [10]:
df.registerTempTable('Titanic')

In [11]:
sql.sql('Select Sex, Survived From Titanic').show()

+------+--------+
|   Sex|Survived|
+------+--------+
|  male|       0|
|female|       1|
|female|       1|
|female|       1|
|  male|       0|
|  male|       0|
|  male|       0|
|  male|       0|
|female|       1|
|female|       1|
|female|       1|
|female|       1|
|  male|       0|
|  male|       0|
|female|       0|
|female|       1|
|  male|       0|
|  male|       1|
|female|       0|
|female|       1|
+------+--------+
only showing top 20 rows

In [12]:
sql.sql('Select distinct(Embarked) From Titanic').show()

+--------+
|Embarked|
+--------+
|       Q|
|    null|
|       C|
|       S|
+--------+

In [13]:
sql.sql('Select min(Age) From Titanic').show()

+--------+
|min(Age)|
+--------+
|    0.42|
+--------+

In [14]:
df1 = df.withColumnRenamed('Sex','Gender')
df1.printSchema()

root
 |-- PassengerId: integer (nullable = true)
 |-- Survived: integer (nullable = true)
 |-- Pclass: integer (nullable = true)
 |-- Name: string (nullable = true)
 |-- Gender: string (nullable = true)
 |-- Age: double (nullable = true)
 |-- SibSp: integer (nullable = true)
 |-- Parch: integer (nullable = true)
 |-- Ticket: string (nullable = true)
 |-- Fare: double (nullable = true)
 |-- Cabin: string (nullable = true)
 |-- Embarked: string (nullable = true)

In [15]:
sql.sql('Select Age, Sex From Titanic').sort(df['Age']).distinct().show()

+----+------+
| Age|   Sex|
+----+------+
|null|  male|
|null|female|
|0.42|  male|
|0.67|  male|
|0.75|female|
|0.83|  male|
|0.92|  male|
| 1.0|  male|
| 1.0|female|
| 2.0|  male|
| 2.0|female|
| 3.0|female|
| 3.0|  male|
| 4.0|female|
| 4.0|  male|
| 5.0|female|
| 6.0|female|
| 6.0|  male|
| 7.0|  male|
| 7.0|female|
+----+------+
only showing top 20 rows

In [16]:
df2 = sql.sql('Select Age, Sex, Embarked From Titanic').sort(df['Age']).dropDuplicates(['Age','Sex'])

In [17]:
joined = df2.join(df2, df2.Sex == df2.Sex).show()

+----+------+--------+----+------+--------+
| Age|   Sex|Embarked| Age|   Sex|Embarked|
+----+------+--------+----+------+--------+
|null|female|       C|63.0|female|       S|
|null|female|       C|62.0|female|    null|
|null|female|       C|60.0|female|       C|
|null|female|       C|58.0|female|       S|
|null|female|       C|57.0|female|       S|
|null|female|       C|56.0|female|       C|
|null|female|       C|55.0|female|       S|
|null|female|       C|54.0|female|       C|
|null|female|       C|53.0|female|       S|
|null|female|       C|52.0|female|       C|
|null|female|       C|51.0|female|       S|
|null|female|       C|50.0|female|       C|
|null|female|       C|49.0|female|       C|
|null|female|       C|48.0|female|       C|
|null|female|       C|47.0|female|       S|
|null|female|       C|45.0|female|       S|
|null|female|       C|44.0|female|       C|
|null|female|       C|43.0|female|       S|
|null|female|       C|42.0|female|       C|
|null|female|       C|41.0|female|       S|
+----+------+--------+----+------+--------+
only showing top 20 rows

# Distinct

In [18]:
sql.sql('SELECT DISTINCT Embarked FROM Titanic').show()

+--------+
|Embarked|
+--------+
|       Q|
|    null|
|       C|
|       S|
+--------+

# Where

In [19]:
sql.sql('SELECT * FROM Titanic WHERE Age BETWEEN 17 and 21').show()
sql.sql('SELECT * FROM Titanic WHERE Age > 17 and Age < 21').show()

+-----------+--------+------+--------------------+------+----+-----+-----+------------------+-------+-----------+--------+
|PassengerId|Survived|Pclass|                Name|   Sex| Age|SibSp|Parch|            Ticket|   Fare|      Cabin|Embarked|
+-----------+--------+------+--------------------+------+----+-----+-----+------------------+-------+-----------+--------+
|         13|       0|     3|Saundercock, Mr. ...|  male|20.0|    0|    0|         A/5. 2151|   8.05|       null|       S|
|         28|       0|     1|Fortune, Mr. Char...|  male|19.0|    3|    2|             19950|  263.0|C23 C25 C27|       S|
|         38|       0|     3|Cann, Mr. Ernest ...|  male|21.0|    0|    0|        A./5. 2152|   8.05|       null|       S|
|         39|       0|     3|Vander Planke, Mi...|female|18.0|    2|    0|            345764|   18.0|       null|       S|
|         45|       1|     3|Devaney, Miss. Ma...|female|19.0|    0|    0|            330958| 7.8792|       null|       Q|
|         50|       0|     3|Arnold-Franchi, M...|female|18.0|    1|    0|            349237|   17.8|       null|       S|
|         52|       0|     3|Nosworthy, Mr. Ri...|  male|21.0|    0|    0|        A/4. 39886|    7.8|       null|       S|
|         57|       1|     2|   Rugg, Miss. Emily|female|21.0|    0|    0|        C.A. 31026|   10.5|       null|       S|
|         68|       0|     3|Crease, Mr. Ernes...|  male|19.0|    0|    0|         S.P. 3464| 8.1583|       null|       S|
|         69|       1|     3|Andersson, Miss. ...|female|17.0|    4|    2|           3101281|  7.925|       null|       S|
|         73|       0|     2|Hood, Mr. Ambrose Jr|  male|21.0|    0|    0|      S.O.C. 14879|   73.5|       null|       S|
|         85|       1|     2| Ilett, Miss. Bertha|female|17.0|    0|    0|        SO/C 14885|   10.5|       null|       S|
|         92|       0|     3|Andreasson, Mr. P...|  male|20.0|    0|    0|            347466| 7.8542|       null|       S|
|        103|       0|     1|White, Mr. Richar...|  male|21.0|    0|    1|             35281|77.2875|        D26|       S|
|        107|       1|     3|Salkjelsvik, Miss...|female|21.0|    0|    0|            343120|   7.65|       null|       S|
|        114|       0|     3|Jussila, Miss. Ka...|female|20.0|    1|    0|              4136|  9.825|       null|       S|
|        115|       0|     3|Attalah, Miss. Ma...|female|17.0|    0|    0|              2627|14.4583|       null|       C|
|        116|       0|     3|Pekoniemi, Mr. Ed...|  male|21.0|    0|    0| STON/O 2. 3101294|  7.925|       null|       S|
|        121|       0|     2|Hickman, Mr. Stan...|  male|21.0|    2|    0|      S.O.C. 14879|   73.5|       null|       S|
|        132|       0|     3|Coelho, Mr. Domin...|  male|20.0|    0|    0|SOTON/O.Q. 3101307|   7.05|       null|       S|
+-----------+--------+------+--------------------+------+----+-----+-----+------------------+-------+-----------+--------+
only showing top 20 rows

+-----------+--------+------+--------------------+------+----+-----+-----+------------------+-------+-----------+--------+
|PassengerId|Survived|Pclass|                Name|   Sex| Age|SibSp|Parch|            Ticket|   Fare|      Cabin|Embarked|
+-----------+--------+------+--------------------+------+----+-----+-----+------------------+-------+-----------+--------+
|         13|       0|     3|Saundercock, Mr. ...|  male|20.0|    0|    0|         A/5. 2151|   8.05|       null|       S|
|         28|       0|     1|Fortune, Mr. Char...|  male|19.0|    3|    2|             19950|  263.0|C23 C25 C27|       S|
|         39|       0|     3|Vander Planke, Mi...|female|18.0|    2|    0|            345764|   18.0|       null|       S|
|         45|       1|     3|Devaney, Miss. Ma...|female|19.0|    0|    0|            330958| 7.8792|       null|       Q|
|         50|       0|     3|Arnold-Franchi, M...|female|18.0|    1|    0|            349237|   17.8|       null|       S|
|         68|       0|     3|Crease, Mr. Ernes...|  male|19.0|    0|    0|         S.P. 3464| 8.1583|       null|       S|
|         92|       0|     3|Andreasson, Mr. P...|  male|20.0|    0|    0|            347466| 7.8542|       null|       S|
|        114|       0|     3|Jussila, Miss. Ka...|female|20.0|    1|    0|              4136|  9.825|       null|       S|
|        132|       0|     3|Coelho, Mr. Domin...|  male|20.0|    0|    0|SOTON/O.Q. 3101307|   7.05|       null|       S|
|        137|       1|     1|Newsom, Miss. Hel...|female|19.0|    0|    2|             11752|26.2833|        D47|       S|
|        144|       0|     3| Burke, Mr. Jeremiah|  male|19.0|    0|    0|            365222|   6.75|       null|       Q|
|        145|       0|     2|Andrew, Mr. Edgar...|  male|18.0|    0|    0|            231945|   11.5|       null|       S|
|        146|       0|     2|Nicholls, Mr. Jos...|  male|19.0|    1|    1|        C.A. 33112|  36.75|       null|       S|
|        176|       0|     3|Klasen, Mr. Klas ...|  male|18.0|    1|    1|            350404| 7.8542|       null|       S|
|        192|       0|     2|Carbines, Mr. Wil...|  male|19.0|    0|    0|             28424|   13.0|       null|       S|
|        193|       1|     3|Andersen-Jensen, ...|female|19.0|    1|    0|            350046| 7.8542|       null|       S|
|        205|       1|     3|"Cohen, Mr. Gursh...|  male|18.0|    0|    0|          A/5 3540|   8.05|       null|       S|
|        227|       1|     2|Mellors, Mr. Will...|  male|19.0|    0|    0|         SW/PP 751|   10.5|       null|       S|
|        228|       0|     3|"Lovell, Mr. John...|  male|20.5|    0|    0|         A/5 21173|   7.25|       null|       S|
|        229|       0|     2|Fahlstrom, Mr. Ar...|  male|18.0|    0|    0|            236171|   13.0|       null|       S|
+-----------+--------+------+--------------------+------+----+-----+-----+------------------+-------+-----------+--------+
only showing top 20 rows

# IN

In [20]:
sql.sql('SELECT * FROM Titanic WHERE Age IN (1,80,90)').show()

+-----------+--------+------+--------------------+------+----+-----+-----+---------------+-------+-----+--------+
|PassengerId|Survived|Pclass|                Name|   Sex| Age|SibSp|Parch|         Ticket|   Fare|Cabin|Embarked|
+-----------+--------+------+--------------------+------+----+-----+-----+---------------+-------+-----+--------+
|        165|       0|     3|Panula, Master. E...|  male| 1.0|    4|    1|        3101295|39.6875| null|       S|
|        173|       1|     3|Johnson, Miss. El...|female| 1.0|    1|    1|         347742|11.1333| null|       S|
|        184|       1|     2|Becker, Master. R...|  male| 1.0|    2|    1|         230136|   39.0|   F4|       S|
|        382|       1|     3|"Nakid, Miss. Mar...|female| 1.0|    0|    2|           2653|15.7417| null|       C|
|        387|       0|     3|Goodwin, Master. ...|  male| 1.0|    5|    2|        CA 2144|   46.9| null|       S|
|        631|       1|     1|Barkworth, Mr. Al...|  male|80.0|    0|    0|          27042|   30.0|  A23|       S|
|        789|       1|     3|Dean, Master. Ber...|  male| 1.0|    1|    2|      C.A. 2315| 20.575| null|       S|
|        828|       1|     2|Mallet, Master. A...|  male| 1.0|    0|    2|S.C./PARIS 2079|37.0042| null|       C|
+-----------+--------+------+--------------------+------+----+-----+-----+---------------+-------+-----+--------+

# Like

In [21]:
sql.sql("SELECT * FROM Titanic WHERE Name Like 'Va%' ").show()

+-----------+--------+------+--------------------+------+----+-----+-----+------+-----+-----+--------+
|PassengerId|Survived|Pclass|                Name|   Sex| Age|SibSp|Parch|Ticket| Fare|Cabin|Embarked|
+-----------+--------+------+--------------------+------+----+-----+-----+------+-----+-----+--------+
|         19|       0|     3|Vander Planke, Mr...|female|31.0|    1|    0|345763| 18.0| null|       S|
|         39|       0|     3|Vander Planke, Mi...|female|18.0|    2|    0|345764| 18.0| null|       S|
|        171|       0|     1|Van der hoef, Mr....|  male|61.0|    0|    0|111240| 33.5|  B19|       S|
|        201|       0|     3|Vande Walle, Mr. ...|  male|28.0|    0|    0|345770|  9.5| null|       S|
|        334|       0|     3|Vander Planke, Mr...|  male|16.0|    2|    0|345764| 18.0| null|       S|
|        356|       0|     3|Vanden Steen, Mr....|  male|28.0|    0|    0|345783|  9.5| null|       S|
|        420|       0|     3|Van Impe, Miss. C...|female|10.0|    0|    2|345773|24.15| null|       S|
|        596|       0|     3|Van Impe, Mr. Jea...|  male|36.0|    1|    1|345773|24.15| null|       S|
|        753|       0|     3|Vande Velde, Mr. ...|  male|33.0|    0|    0|345780|  9.5| null|       S|
|        800|       0|     3|Van Impe, Mrs. Je...|female|30.0|    1|    1|345773|24.15| null|       S|
|        874|       0|     3|Vander Cruyssen, ...|  male|47.0|    0|    0|345765|  9.0| null|       S|
+-----------+--------+------+--------------------+------+----+-----+-----+------+-----+-----+--------+

In [22]:
sql.sql("SELECT * FROM Titanic WHERE Name Like '%z%' ").show()

+-----------+--------+------+--------------------+------+----+-----+-----+----------+-------+-----------+--------+
|PassengerId|Survived|Pclass|                Name|   Sex| Age|SibSp|Parch|    Ticket|   Fare|      Cabin|Embarked|
+-----------+--------+------+--------------------+------+----+-----+-----+----------+-------+-----------+--------+
|         12|       1|     1|Bonnell, Miss. El...|female|58.0|    0|    0|    113783|  26.55|       C103|       S|
|         54|       1|     2|Faunthorpe, Mrs. ...|female|29.0|    1|    0|      2926|   26.0|       null|       S|
|         67|       1|     2|Nye, Mrs. (Elizab...|female|29.0|    0|    0|C.A. 29395|   10.5|        F33|       S|
|         70|       0|     3|   Kink, Mr. Vincenz|  male|26.0|    2|    0|    315151| 8.6625|       null|       S|
|         80|       1|     3|Dowdell, Miss. El...|female|30.0|    0|    0|    364516| 12.475|       null|       S|
|        131|       0|     3|Drazenoic, Mr. Jozef|  male|33.0|    0|    0|    349241| 7.8958|       null|       C|
|        134|       1|     2|Weisz, Mrs. Leopo...|female|29.0|    1|    0|    228414|   26.0|       null|       S|
|        153|       0|     3|    Meo, Mr. Alfonzo|  male|55.5|    0|    0|A.5. 11206|   8.05|       null|       S|
|        162|       1|     2|"Watt, Mrs. James...|female|40.0|    0|    0|C.A. 33595|  15.75|       null|       S|
|        178|       0|     1|Isham, Miss. Ann ...|female|50.0|    0|    0|  PC 17595|28.7125|        C49|       C|
|        219|       1|     1|Bazzani, Miss. Al...|female|32.0|    0|    0|     11813|76.2917|        D15|       C|
|        256|       1|     3|Touma, Mrs. Darwi...|female|29.0|    0|    2|      2650|15.2458|       null|       C|
|        273|       1|     2|Mellinger, Mrs. (...|female|41.0|    0|    1|    250644|   19.5|       null|       S|
|        308|       1|     1|Penasco y Castell...|female|17.0|    1|    0|  PC 17758|  108.9|        C65|       C|
|        338|       1|     1|Burns, Miss. Eliz...|female|41.0|    0|    0|     16966|  134.5|        E40|       C|
|        342|       1|     1|Fortune, Miss. Al...|female|24.0|    3|    2|     19950|  263.0|C23 C25 C27|       S|
|        355|       0|     3|   Yousif, Mr. Wazli|  male|null|    0|    0|      2647|  7.225|       null|       C|
|        366|       0|     3|Adahl, Mr. Maurit...|  male|30.0|    0|    0|    C 7076|   7.25|       null|       S|
|        431|       1|     1|Bjornstrom-Steffa...|  male|28.0|    0|    0|    110564|  26.55|        C52|       S|
|        455|       0|     3| Peduzzi, Mr. Joseph|  male|null|    0|    0|  A/5 2817|   8.05|       null|       S|
+-----------+--------+------+--------------------+------+----+-----+-----+----------+-------+-----------+--------+
only showing top 20 rows

# Wild Cards
%   -> zero or more characters
_   -> exactly one character
[]  -> Any character in bracket
[^] -> Any character except in bracket

In [23]:
sql.sql("SELECT * FROM Titanic WHERE Name Like '[A]' ").show()

+-----------+--------+------+----+---+---+-----+-----+------+----+-----+--------+
|PassengerId|Survived|Pclass|Name|Sex|Age|SibSp|Parch|Ticket|Fare|Cabin|Embarked|
+-----------+--------+------+----+---+---+-----+-----+------+----+-----+--------+
+-----------+--------+------+----+---+---+-----+-----+------+----+-----+--------+

# Order By

In [24]:
sql.sql("SELECT * FROM Titanic ORDER BY Fare DESC").show()

+-----------+--------+------+--------------------+------+----+-----+-----+--------+--------+---------------+--------+
|PassengerId|Survived|Pclass|                Name|   Sex| Age|SibSp|Parch|  Ticket|    Fare|          Cabin|Embarked|
+-----------+--------+------+--------------------+------+----+-----+-----+--------+--------+---------------+--------+
|        738|       1|     1|Lesurer, Mr. Gust...|  male|35.0|    0|    0|PC 17755|512.3292|           B101|       C|
|        680|       1|     1|Cardeza, Mr. Thom...|  male|36.0|    0|    1|PC 17755|512.3292|    B51 B53 B55|       C|
|        259|       1|     1|    Ward, Miss. Anna|female|35.0|    0|    0|PC 17755|512.3292|           null|       C|
|        342|       1|     1|Fortune, Miss. Al...|female|24.0|    3|    2|   19950|   263.0|    C23 C25 C27|       S|
|        439|       0|     1|   Fortune, Mr. Mark|  male|64.0|    1|    4|   19950|   263.0|    C23 C25 C27|       S|
|         28|       0|     1|Fortune, Mr. Char...|  male|19.0|    3|    2|   19950|   263.0|    C23 C25 C27|       S|
|         89|       1|     1|Fortune, Miss. Ma...|female|23.0|    3|    2|   19950|   263.0|    C23 C25 C27|       S|
|        743|       1|     1|"Ryerson, Miss. S...|female|21.0|    2|    2|PC 17608| 262.375|B57 B59 B63 B66|       C|
|        312|       1|     1|Ryerson, Miss. Em...|female|18.0|    2|    2|PC 17608| 262.375|B57 B59 B63 B66|       C|
|        119|       0|     1|Baxter, Mr. Quigg...|  male|24.0|    0|    1|PC 17558|247.5208|        B58 B60|       C|
|        300|       1|     1|Baxter, Mrs. Jame...|female|50.0|    0|    1|PC 17558|247.5208|        B58 B60|       C|
|        558|       0|     1| Robbins, Mr. Victor|  male|null|    0|    0|PC 17757| 227.525|           null|       C|
|        701|       1|     1|Astor, Mrs. John ...|female|18.0|    1|    0|PC 17757| 227.525|        C62 C64|       C|
|        717|       1|     1|Endres, Miss. Car...|female|38.0|    0|    0|PC 17757| 227.525|            C45|       C|
|        381|       1|     1|Bidois, Miss. Ros...|female|42.0|    0|    0|PC 17757| 227.525|           null|       C|
|        528|       0|     1|  Farthing, Mr. John|  male|null|    0|    0|PC 17483|221.7792|            C95|       S|
|        378|       0|     1|Widener, Mr. Harr...|  male|27.0|    0|    2|  113503|   211.5|            C82|       C|
|        690|       1|     1|Madill, Miss. Geo...|female|15.0|    0|    1|   24160|211.3375|             B5|       S|
|        731|       1|     1|Allen, Miss. Elis...|female|29.0|    0|    0|   24160|211.3375|             B5|       S|
|        780|       1|     1|Robert, Mrs. Edwa...|female|43.0|    0|    1|   24160|211.3375|             B3|       S|
+-----------+--------+------+--------------------+------+----+-----+-----+--------+--------+---------------+--------+
only showing top 20 rows

# Limit

In [25]:
sql.sql("SELECT * FROM Titanic ORDER BY Fare DESC LIMIT 2").show()

+-----------+--------+------+--------------------+------+----+-----+-----+--------+--------+-----------+--------+
|PassengerId|Survived|Pclass|                Name|   Sex| Age|SibSp|Parch|  Ticket|    Fare|      Cabin|Embarked|
+-----------+--------+------+--------------------+------+----+-----+-----+--------+--------+-----------+--------+
|        259|       1|     1|    Ward, Miss. Anna|female|35.0|    0|    0|PC 17755|512.3292|       null|       C|
|        680|       1|     1|Cardeza, Mr. Thom...|  male|36.0|    0|    1|PC 17755|512.3292|B51 B53 B55|       C|
+-----------+--------+------+--------------------+------+----+-----+-----+--------+--------+-----------+--------+

# Group By

In [26]:
sql.sql("SELECT Sex, Embarked, AVG(Age) FROM Titanic GROUP BY Sex, Embarked").show()

+------+--------+------------------+
|   Sex|Embarked|          avg(Age)|
+------+--------+------------------+
|  male|       C| 32.99884057971015|
|  male|       S|30.291440217391305|
|female|       Q|24.291666666666668|
|female|    null|              50.0|
|female|       S|27.771505376344088|
|  male|       Q|           30.9375|
|female|       C| 28.34426229508197|
+------+--------+------------------+

In [27]:
sql.sql("SELECT Sex, AVG(Age) AS Avg FROM Titanic GROUP BY Sex, Embarked ORDER BY Avg").show()

+------+------------------+
|   Sex|               Avg|
+------+------------------+
|female|24.291666666666668|
|female|27.771505376344088|
|female| 28.34426229508197|
|  male|30.291440217391305|
|  male|           30.9375|
|  male| 32.99884057971015|
|female|              50.0|
+------+------------------+

In [28]:
sql.sql("SELECT Sex, Embarked, AVG(Age), Count(*) FROM Titanic GROUP BY Sex, Embarked").show()

+------+--------+------------------+--------+
|   Sex|Embarked|          avg(Age)|count(1)|
+------+--------+------------------+--------+
|  male|       C| 32.99884057971015|      95|
|  male|       S|30.291440217391305|     441|
|female|       Q|24.291666666666668|      36|
|female|    null|              50.0|       2|
|female|       S|27.771505376344088|     203|
|  male|       Q|           30.9375|      41|
|female|       C| 28.34426229508197|      73|
+------+--------+------------------+--------+

# HAVING
The HAVING clause was added to SQL because the WHERE keyword could not be used with aggregate functions.

In [29]:
sql.sql("SELECT Embarked, AVG(Age), COUNT(*) FROM Titanic GROUP BY Embarked HAVING COUNT(Embarked) > 100").show()

+--------+-----------------+--------+
|Embarked|         avg(Age)|count(1)|
+--------+-----------------+--------+
|       C|30.81476923076923|     168|
|       S|29.44539711191336|     644|
+--------+-----------------+--------+

Performance wise Having is slower than Where because where first filters rows and then groups

In [30]:
sql.sql("SELECT Embarked, AVG(Age) FROM Titanic WHERE Embarked IN ('C','S') GROUP BY Embarked").show()

sql.sql("SELECT Embarked, AVG(Age) FROM Titanic GROUP BY Embarked HAVING Embarked IN ('C','S')").show()

+--------+-----------------+
|Embarked|         avg(Age)|
+--------+-----------------+
|       C|30.81476923076923|
|       S|29.44539711191336|
+--------+-----------------+

+--------+-----------------+
|Embarked|         avg(Age)|
+--------+-----------------+
|       C|30.81476923076923|
|       S|29.44539711191336|
+--------+-----------------+

# OVER

Needed because we want aggregated and non aaggregated data

-- Syntax for SQL Server, Azure SQL Database, and Azure SQL Data Warehouse  
  
OVER (   
       [ <PARTITION BY clause> ]  
       [ <ORDER BY clause> ]   
       [ <ROW or RANGE clause> ]  
      )  
  
<PARTITION BY clause> ::=  
PARTITION BY value_expression , ... [ n ]  
  
<ORDER BY clause> ::=  
ORDER BY order_by_expression  
    [ COLLATE collation_name ]   
    [ ASC | DESC ]   
    [ ,...n ]  
  
<ROW or RANGE clause> ::=  
{ ROWS | RANGE } <window frame extent>  
  
<window frame extent> ::=   
{   <window frame preceding>  
  | <window frame between>  
}  
<window frame between> ::=   
  BETWEEN <window frame bound> AND <window frame bound>  
  
<window frame bound> ::=   
{   <window frame preceding>  
  | <window frame following>  
}  
  
<window frame preceding> ::=   
{  
    UNBOUNDED PRECEDING  
  | <unsigned_value_specification> PRECEDING  
  | CURRENT ROW  
}  
  
<window frame following> ::=   
{  
    UNBOUNDED FOLLOWING  
  | <unsigned_value_specification> FOLLOWING  
  | CURRENT ROW  
}  
  
<unsigned value specification> ::=   
{  <unsigned integer literal> }

In [31]:
sql.sql('SELECT Embarked, Sex, COUNT(Sex) OVER(PARTITION BY Sex) FROM Titanic').show()

+--------+------+-------------------------------------------------------------------------------------------+
|Embarked|   Sex|count(Sex) OVER (PARTITION BY Sex ROWS BETWEEN UNBOUNDED PRECEDING AND UNBOUNDED FOLLOWING)|
+--------+------+-------------------------------------------------------------------------------------------+
|       C|female|                                                                                        314|
|       S|female|                                                                                        314|
|       S|female|                                                                                        314|
|       S|female|                                                                                        314|
|       C|female|                                                                                        314|
|       S|female|                                                                                        314|
|       S|female|                                                                                        314|
|       S|female|                                                                                        314|
|       S|female|                                                                                        314|
|       S|female|                                                                                        314|
|       C|female|                                                                                        314|
|       Q|female|                                                                                        314|
|       S|female|                                                                                        314|
|       S|female|                                                                                        314|
|       Q|female|                                                                                        314|
|       C|female|                                                                                        314|
|       Q|female|                                                                                        314|
|       S|female|                                                                                        314|
|       C|female|                                                                                        314|
|       S|female|                                                                                        314|
+--------+------+-------------------------------------------------------------------------------------------+
only showing top 20 rows

In [32]:
sql.sql('SELECT AVG(Age) OVER() AS AvgAge, Name FROM Titanic').show()

+-----------------+--------------------+
|           AvgAge|                Name|
+-----------------+--------------------+
|29.69911764705882|Braund, Mr. Owen ...|
|29.69911764705882|Cumings, Mrs. Joh...|
|29.69911764705882|Heikkinen, Miss. ...|
|29.69911764705882|Futrelle, Mrs. Ja...|
|29.69911764705882|Allen, Mr. Willia...|
|29.69911764705882|    Moran, Mr. James|
|29.69911764705882|McCarthy, Mr. Tim...|
|29.69911764705882|Palsson, Master. ...|
|29.69911764705882|Johnson, Mrs. Osc...|
|29.69911764705882|Nasser, Mrs. Nich...|
|29.69911764705882|Sandstrom, Miss. ...|
|29.69911764705882|Bonnell, Miss. El...|
|29.69911764705882|Saundercock, Mr. ...|
|29.69911764705882|Andersson, Mr. An...|
|29.69911764705882|Vestrom, Miss. Hu...|
|29.69911764705882|Hewlett, Mrs. (Ma...|
|29.69911764705882|Rice, Master. Eugene|
|29.69911764705882|Williams, Mr. Cha...|
|29.69911764705882|Vander Planke, Mr...|
|29.69911764705882|Masselmani, Mrs. ...|
+-----------------+--------------------+
only showing top 20 rows

In [33]:
sql.sql('SELECT AVG(Age) OVER() AS AvgAge, Count(Embarked) OVER() AS EmbCount, * FROM Titanic').show()

+-----------------+--------+-----------+--------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
|           AvgAge|EmbCount|PassengerId|Survived|Pclass|                Name|   Sex| Age|SibSp|Parch|          Ticket|   Fare|Cabin|Embarked|
+-----------------+--------+-----------+--------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
|29.69911764705882|     889|          1|       0|     3|Braund, Mr. Owen ...|  male|22.0|    1|    0|       A/5 21171|   7.25| null|       S|
|29.69911764705882|     889|          2|       1|     1|Cumings, Mrs. Joh...|female|38.0|    1|    0|        PC 17599|71.2833|  C85|       C|
|29.69911764705882|     889|          3|       1|     3|Heikkinen, Miss. ...|female|26.0|    0|    0|STON/O2. 3101282|  7.925| null|       S|
|29.69911764705882|     889|          4|       1|     1|Futrelle, Mrs. Ja...|female|35.0|    1|    0|          113803|   53.1| C123|       S|
|29.69911764705882|     889|          5|       0|     3|Allen, Mr. Willia...|  male|35.0|    0|    0|          373450|   8.05| null|       S|
|29.69911764705882|     889|          6|       0|     3|    Moran, Mr. James|  male|null|    0|    0|          330877| 8.4583| null|       Q|
|29.69911764705882|     889|          7|       0|     1|McCarthy, Mr. Tim...|  male|54.0|    0|    0|           17463|51.8625|  E46|       S|
|29.69911764705882|     889|          8|       0|     3|Palsson, Master. ...|  male| 2.0|    3|    1|          349909| 21.075| null|       S|
|29.69911764705882|     889|          9|       1|     3|Johnson, Mrs. Osc...|female|27.0|    0|    2|          347742|11.1333| null|       S|
|29.69911764705882|     889|         10|       1|     2|Nasser, Mrs. Nich...|female|14.0|    1|    0|          237736|30.0708| null|       C|
|29.69911764705882|     889|         11|       1|     3|Sandstrom, Miss. ...|female| 4.0|    1|    1|         PP 9549|   16.7|   G6|       S|
|29.69911764705882|     889|         12|       1|     1|Bonnell, Miss. El...|female|58.0|    0|    0|          113783|  26.55| C103|       S|
|29.69911764705882|     889|         13|       0|     3|Saundercock, Mr. ...|  male|20.0|    0|    0|       A/5. 2151|   8.05| null|       S|
|29.69911764705882|     889|         14|       0|     3|Andersson, Mr. An...|  male|39.0|    1|    5|          347082| 31.275| null|       S|
|29.69911764705882|     889|         15|       0|     3|Vestrom, Miss. Hu...|female|14.0|    0|    0|          350406| 7.8542| null|       S|
|29.69911764705882|     889|         16|       1|     2|Hewlett, Mrs. (Ma...|female|55.0|    0|    0|          248706|   16.0| null|       S|
|29.69911764705882|     889|         17|       0|     3|Rice, Master. Eugene|  male| 2.0|    4|    1|          382652| 29.125| null|       Q|
|29.69911764705882|     889|         18|       1|     2|Williams, Mr. Cha...|  male|null|    0|    0|          244373|   13.0| null|       S|
|29.69911764705882|     889|         19|       0|     3|Vander Planke, Mr...|female|31.0|    1|    0|          345763|   18.0| null|       S|
|29.69911764705882|     889|         20|       1|     3|Masselmani, Mrs. ...|female|null|    0|    0|            2649|  7.225| null|       C|
+-----------------+--------+-----------+--------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
only showing top 20 rows

In [34]:
sql.sql('SELECT AVG(Age) OVER() AS AvgAge, AVG(Age) OVER() - Age AS AgeDiff, Name FROM Titanic').show()

+-----------------+------------------+--------------------+
|           AvgAge|           AgeDiff|                Name|
+-----------------+------------------+--------------------+
|29.69911764705882|  7.69911764705882|Braund, Mr. Owen ...|
|29.69911764705882| -8.30088235294118|Cumings, Mrs. Joh...|
|29.69911764705882|  3.69911764705882|Heikkinen, Miss. ...|
|29.69911764705882| -5.30088235294118|Futrelle, Mrs. Ja...|
|29.69911764705882| -5.30088235294118|Allen, Mr. Willia...|
|29.69911764705882|              null|    Moran, Mr. James|
|29.69911764705882|-24.30088235294118|McCarthy, Mr. Tim...|
|29.69911764705882| 27.69911764705882|Palsson, Master. ...|
|29.69911764705882|  2.69911764705882|Johnson, Mrs. Osc...|
|29.69911764705882| 15.69911764705882|Nasser, Mrs. Nich...|
|29.69911764705882| 25.69911764705882|Sandstrom, Miss. ...|
|29.69911764705882|-28.30088235294118|Bonnell, Miss. El...|
|29.69911764705882|  9.69911764705882|Saundercock, Mr. ...|
|29.69911764705882| -9.30088235294118|Andersson, Mr. An...|
|29.69911764705882| 15.69911764705882|Vestrom, Miss. Hu...|
|29.69911764705882|-25.30088235294118|Hewlett, Mrs. (Ma...|
|29.69911764705882| 27.69911764705882|Rice, Master. Eugene|
|29.69911764705882|              null|Williams, Mr. Cha...|
|29.69911764705882| -1.30088235294118|Vander Planke, Mr...|
|29.69911764705882|              null|Masselmani, Mrs. ...|
+-----------------+------------------+--------------------+
only showing top 20 rows

In [35]:
sql.sql('SELECT DISTINCT Embarked, COUNT(1) OVER(PARTITION BY Embarked) AS NUM, COUNT(1) OVER() AS TotalCount FROM Titanic').show()

+--------+---+----------+
|Embarked|NUM|TotalCount|
+--------+---+----------+
|    null|  2|       891|
|       C|168|       891|
|       Q| 77|       891|
|       S|644|       891|
+--------+---+----------+

In [36]:
sql.sql('SELECT PassengerId, SUM(Fare) OVER(ORDER BY PassengerId) AS FareCumSum, COUNT(1) OVER() AS TotalCount FROM Titanic').show()

+-----------+------------------+----------+
|PassengerId|        FareCumSum|TotalCount|
+-----------+------------------+----------+
|          1|              7.25|       891|
|          2|           78.5333|       891|
|          3|           86.4583|       891|
|          4|          139.5583|       891|
|          5|          147.6083|       891|
|          6|156.06660000000002|       891|
|          7|          207.9291|       891|
|          8|          229.0041|       891|
|          9|240.13739999999999|       891|
|         10|          270.2082|       891|
|         11|286.90819999999997|       891|
|         12|          313.4582|       891|
|         13|          321.5082|       891|
|         14|352.78319999999997|       891|
|         15|360.63739999999996|       891|
|         16|376.63739999999996|       891|
|         17|405.76239999999996|       891|
|         18|418.76239999999996|       891|
|         19|436.76239999999996|       891|
|         20|          443.9874|       891|
+-----------+------------------+----------+
only showing top 20 rows

# JOIN

In [50]:
from pyspark.sql import Row

l = [(1,25),(2,22),(3,20),(4,26)]
rdd = sc.parallelize(l)
people = rdd.map(lambda x: Row(id=x[0], age=int(x[1])))
leftDF = sql.createDataFrame(people)
leftDF.registerTempTable('leftDF')
leftDF.show()

+---+---+
|age| id|
+---+---+
| 25|  1|
| 22|  2|
| 20|  3|
| 26|  4|
+---+---+

In [51]:
l = [(2,100000),(3,95000),(4,120000),(5,110000)]
rdd = sc.parallelize(l)
people = rdd.map(lambda x: Row(id=x[0], salary=int(x[1])))
rightDF = sql.createDataFrame(people)
rightDF.registerTempTable('rightDF')
rightDF.show()

+---+------+
| id|salary|
+---+------+
|  2|100000|
|  3| 95000|
|  4|120000|
|  5|110000|
+---+------+

# Inner Join

In [43]:
sql.sql('SELECT * FROM leftDF INNER JOIN rightDF ON leftDF.id = rightDF.id').show()

+---+---+---+------+
|age| id| id|salary|
+---+---+---+------+
| 20|  3|  3| 95000|
| 22|  2|  2|100000|
| 26|  4|  4|120000|
+---+---+---+------+

# Left Outer Join

In [44]:
sql.sql('SELECT * FROM leftDF LEFT OUTER JOIN rightDF ON leftDF.id = rightDF.id').show()

+---+---+----+------+
|age| id|  id|salary|
+---+---+----+------+
| 25|  1|null|  null|
| 20|  3|   3| 95000|
| 22|  2|   2|100000|
| 26|  4|   4|120000|
+---+---+----+------+

# Right Outer Join

In [45]:
sql.sql('SELECT * FROM leftDF RIGHT OUTER JOIN rightDF ON leftDF.id = rightDF.id').show()

+----+----+---+------+
| age|  id| id|salary|
+----+----+---+------+
|null|null|  5|110000|
|  20|   3|  3| 95000|
|  22|   2|  2|100000|
|  26|   4|  4|120000|
+----+----+---+------+

# Full Outer Join

In [46]:
sql.sql('SELECT * FROM leftDF FULL OUTER JOIN rightDF ON leftDF.id = rightDF.id').show()

+----+----+----+------+
| age|  id|  id|salary|
+----+----+----+------+
|null|null|   5|110000|
|  25|   1|null|  null|
|  20|   3|   3| 95000|
|  22|   2|   2|100000|
|  26|   4|   4|120000|
+----+----+----+------+

# Cross Join

In [47]:
sql.sql('SELECT * FROM leftDF CROSS JOIN rightDF').show()

+---+---+---+------+
|age| id| id|salary|
+---+---+---+------+
| 25|  1|  2|100000|
| 25|  1|  3| 95000|
| 25|  1|  4|120000|
| 25|  1|  5|110000|
| 22|  2|  2|100000|
| 22|  2|  3| 95000|
| 22|  2|  4|120000|
| 22|  2|  5|110000|
| 20|  3|  2|100000|
| 20|  3|  3| 95000|
| 20|  3|  4|120000|
| 20|  3|  5|110000|
| 26|  4|  2|100000|
| 26|  4|  3| 95000|
| 26|  4|  4|120000|
| 26|  4|  5|110000|
+---+---+---+------+

# Self Join

In [49]:
sql.sql('SELECT * FROM leftDF a, leftDF b WHERE a.age > b.age').show()

+---+---+---+---+
|age| id|age| id|
+---+---+---+---+
| 25|  1| 22|  2|
| 25|  1| 20|  3|
| 22|  2| 20|  3|
| 26|  4| 25|  1|
| 26|  4| 22|  2|
| 26|  4| 20|  3|
+---+---+---+---+